In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql sqlite:///livres_db

In [7]:
%sql SELECT * FROM Auteurs WHERE 1;

 * sqlite:///livres_db
Done.

[(0, 'Lecluse', 'Olivier', 2, 1870),
 (1, 'Orwell', 'George', 1, 1903),
 (2, 'Herbert', 'Frank', 1, 1920),
 (3, 'Asimov', 'Isaac', 1, 1920),
 (4, 'Huxley', 'Aldous', 1, 1894),
 (5, 'Bradbury', 'Ray', 1, 1920),
 (6, 'K. Dick', 'Philip', 1, 1928),
 (7, 'Barjavel', 'René', 2, 1911),
 (8, 'Boulle', 'Pierre', 2, 1912),
 (9, 'Van Vogt', 'Alfred Elton', 1, 1912),
 (10, 'Verne', 'Jules', 2, 1828)]

In [13]:
%sql SELECT name FROM sqlite_schema WHERE type ='table';

 * sqlite:///livres_db
Done.

[('Langues',),
 ('Auteurs',),
 ('Livres',),
 ('Themes',),
 ('RelationsLivreTheme',)]